{"recipeSteps": [{"group": {"steps": [{"text": "Start by making the syrup for this for which take a saucepan and add the 2 cups of sugar, about 3/4 a cup of water and heat this up in medium flame."}, {"text": "Stir occasionally until the syrup gets a roaring boil, and the sugar is all dissolved. If the syrup is dirty or cloudy, add the 2 tbsp of milk. Stir once and let it boil for 10-15 seconds in low flame. Using a skimmer, skim the dirt off the syrup. If necessary, you can strain it as well, but skimmer should just work well."}, {"text": "Add kesar food color to the syrup, along with the cream of tartar or the lemon wedges. Cook for about one more minute in low-med flame. The syrup should be ready, to test add a drop of syrup in a bowl/plate and let it cool for a minute. Touch with your index finger, and then stick your index finger and thumb and then gently-slowy pull off the index finger. A small thread should form also the syrup would be sticky, the syrup is ready. If its forming a thick thread and more than one, add about 2-3 tbsp water to the syrup to get it back to a less than a single thread consistency. Switch off the flame and let it cool while we'll make the batter. Remove the lemon wedges after its warm."}, {"text": "To make the batter, take about 1/3 cup of water and then add the rangkat hydro and then add the flour. Using hands, form this into a thick paste kind of batter. Add 2 more tbsp water if required be careful with the water amounts or else it would be very watery and flow-y. Once it is formed into a thick paste kind of batter, mix this in a rotating motion for about 5 minutes. This will turn from this thick paste kind to a batter that is thick, but flows like a liquid, and is exceptionally smooth and is kind of stringy if you touch your finger and pull back. This is what we want, this smoothness(aka chikna) and the flowy consistency while being thick."}, {"text": "Also, all the agitation you did will bring a lot of air into the batter which is great! And you will see a lot of bubbles. One thing to note : This gets thick and stiff when you keep it idle even for 5 mins and a kind of skin forms in top, and then when you whip it again it gets back flowy."}, {"text": "I've made jalebis in Ghee as well as in Oil, I'd recommend to make them in oil.. They are very heavy on stomach when made in ghee. And keep in mind this comes from me, a marwadi, who eats ghee parathas everyday!"}, {"text": "Heat up oil about 1/2-3/4 inch in a fry pan or a tai in medium flame."}, {"text": "Add the 1/2 tsp baking powder to the batter, mix well and then transfer the batter to a disposable piping bag or a zip lock bag or a ketchup bottle or a lota/condensed milk tin which has a hole in center or a specially stitched jalebi cloth. Snip the bottom of the piping bag using a pair of scissors. Be sure to cut small, because you can't make it smaller if you make the hole bigger. Also it is not only the hole's diameter which determiners the thickness, the pressure of your hands plays a great role as well."}, {"text": "Before making jalebis, make sure the syrup is warm neither hot nor cold. You need atleast 1 1/2 to 2 inches of syrup in your pan so that the steam turns out and syrup goes in. We want to make sure the syrup is good enough for us to dunk the jalebis. Also the oil should not be hot. It should be low-med hot."}, {"text": "Test by making a jalebi, if the jalebi moves with your hand while shaping its very hot, let it cool. It should be such that you can shape the jalebi then it starts sizzling and the bubbles start appearing."}, {"text": "Make jalebis in the oil with patience, the shape comes with practice, look forward to have more patience. Cook the jalebis in medium flame till its well cooked, almost all bubbles are gone and it looks firm and is starting to golden and is slightly golden..Now's the tricky part, you need to be as fast as you can. Keep a tong in one hand and a skimmer in another."}, {"text": "Using the tongs pick the jalebi and dunk it in using the skimmer inside the syrup for 10-20 seconds.Keep the jalebis inside using the skimmer.. Take the jalebis out using the skimmer and ENJOY THE FRESHEST AND THE BEST JALEBI, because there's nothing like eating one straight from the pan! :D"}, {"text": "Make more jalebis, the same way and serve piping hot to you and your dear ones :)"}], "name": ""}}], "prepTime": "N/A", "totalTime": "N/A", "created": 1420859318000, "content": "Hey Foodies,<br /><br />If we do something like a Requested Recipe of the year, Jalebi would be for 2014 :D I’ve been experimenting all year to make the perfect jalebi, that is crispy from out filled with the syrup inside, does not get soggy, and is better than the market ones!<br /><br /><a href=\"https://firebasestorage.googleapis.com/v0/b/cscom-2019.appspot.com/o/content%2F2015%2F01%2FJalebi2.jpg?alt=media\"><img class=\"alignnone size-full wp-image-2231\" src=\"https://firebasestorage.googleapis.com/v0/b/cscom-2019.appspot.com/o/content%2F2015%2F01%2FJalebi2.jpg?alt=media\" alt=\"Jalebi2\" width=\"1920\" height=\"1080\" /></a><br /><br />I’ve tried almost every way to make jalebi in the past year, be it the traditional style using yogurt, with curd and baking soda, With Only Baking Soda, Plain method without anything, using a portion of urad dal.. Instant ways as well, using yeast, using baking soda and powder, using baking soda and citric acid, using fruit salt, using urad dal which turns into a lil kind of imarti.. But no luck, Its not like I mean these methods aren't good or any recipe is bad.. I've tried making these all ways, but the results were not as i expected them, maybe I had expected more than i should.. The basic problems in most ways is the jalebis are either soft. they turn soggy after keeping in syrup, turns limp, is chewy, jalebis dont take syrup in, is flat, is bread like, is yeasty and crunchy like hell as well!<br />So you must be thinking, what makes it perfect? What is the thing that makes it good? It is Hydro, also known as Rangkat or Rangkat Hydro. Upon researching, found it is Sodium Hydrosulfite / Sodium Dithionite. Which is a vat reducing / bleaching agent as a technical grade product.  But this is used in food industry as a preservative and also in sweets for which a food-grade is sold i believe. And In India, this is a common ingredient used by Halwais, but it is kept to themselves. Easily available in Wholesale Grocery Stores and Bakery Supply Stores. Chances are almost none that your nearby-retail store or supermarket would carry this. I also found this <a href=\"http://honestyshop.in/index.php?id_product=639&amp;controller=product\">link while researching from where you can buy this, I am in no-way related to this website. If you are doing any transaction, please do it in your risk.</a> I bought from my bakery supply store. And if you have made or are able to make jalebis, Hats off and Salute to you! Seriously, it isn't easy to make and perfect these! So, Hats off and Salute! :)<br /><br /><a href=\"https://firebasestorage.googleapis.com/v0/b/cscom-2019.appspot.com/o/content%2F2015%2F01%2FJalebi6.jpg?alt=media\"><img class=\"alignnone size-full wp-image-2235\" src=\"https://firebasestorage.googleapis.com/v0/b/cscom-2019.appspot.com/o/content%2F2015%2F01%2FJalebi6.jpg?alt=media\" alt=\"Jalebi6\" width=\"1920\" height=\"1078\" /></a><br /><br />&nbsp;<br /><br />What is the role in the recipe? Just a pinch of this is very powerful in its work. What does it do? Well, we basically take a pinch of it, add to a cup of flour add water and make a thick batter. Then beat it, the agitation helps in incorporating air to the batter. Also while this turns from a very thick paste kind batter to a free-flowing smooth(kind of slang but \"chikna\") batter. The consistency is difficult to explain, but have you seen a halwai making jalebis? The batter flows in a stream when he presses the batter, and stops the flow when he does.. This is what it does, the consistency is such it is flow(y) yet thick. A leavener is added to ensure they puff a tad bit and also get crispier. What it does it makes the batter super smooth, thick yet flowy and eliminates the step to ferment the batter. To make the jalebis, its important to have the smoothness, and the thick yet flowy consistency which this Hydro gives.<br /><br /><a href=\"https://firebasestorage.googleapis.com/v0/b/cscom-2019.appspot.com/o/content%2F2015%2F01%2FJalebi4.jpg?alt=media\"><img class=\"alignnone size-full wp-image-2233\" src=\"https://firebasestorage.googleapis.com/v0/b/cscom-2019.appspot.com/o/content%2F2015%2F01%2FJalebi4.jpg?alt=media\" alt=\"Jalebi4\" width=\"1920\" height=\"1078\" /></a><br /><br />A few months earlier, I was talking to one vendor who has multiple stores, he said, \"hum log to pehle wale batter me aur maida daal ke banate hain har roj.. and so on..\" Translate: We make it by mixing more flour to the last day's batter which works as a culture/starter.. Which runs like a chain from years to them, something like we make yogurt. I then asked whether if he can share some of his batter and the way he makes? He shared! I brought the batter and first saw the consistency, and there i was amazed to see thick yet flowy.. It was stringy as well, like if you put your finger in and pull it back string forms and was a little sticky and extremely smooth and chikna.. Then i made jalebis with it, they were awesome.. I was happy to make them, though i dint make the batter.. Then i made the batter the way he said, 1 kilo maida me 200g dahi mila ke thoro pani dal ke fet ke rakh do, jaise rat ko 10 baje banaya to kal 2 baje jalebi banagi. (mix 1kg flour, 200g yogurt and water as required. make a batter and beat. then keep for fermenting). I did the same way, but it din't work. It wasn't at all the way his batter looked and feel like and even taste like. Still i made jalebis and but they were not good.. Some were chewy and bread like and some were soft and limp..<br /><div>He said, making jalebi is easy if you have a culture from last day.</div><br /><div></div><br /><div>The way he said to make these, dint work for me but the batter he gave me changed the way i was looking forward to make jalebis.. I was aiming to achieve the same batter, which led to this Hydro which makes this happen. And trust me, his batter did have this i can guarantee that. He din't share that (why would he?)..</div><br />&nbsp;<br /><br /><a href=\"https://firebasestorage.googleapis.com/v0/b/cscom-2019.appspot.com/o/content%2F2015%2F01%2FJalebi3.jpg?alt=media\"><img class=\"size-full wp-image-2232 aligncenter\" src=\"https://firebasestorage.googleapis.com/v0/b/cscom-2019.appspot.com/o/content%2F2015%2F01%2FJalebi3.jpg?alt=media\" alt=\"Jalebi3\" width=\"760\" height=\"1080\" /></a><br /><br />After thinking a lot and researching, I got to know about the magic ingredient and, after that I've been getting perfect jalebis everytime! They're crisp, they are succulent, they are not extensively chewy, they don't get soggy and best of all they're way better than the market ones and not to forget this is an Instant Recipe YAY for that.. You can whip this up anytime you wish requires no yeast, no fruit salt, no fermentation :D ! Let's get into the recipe :t<br /><br /><a href=\"https://firebasestorage.googleapis.com/v0/b/cscom-2019.appspot.com/o/content%2F2015%2F01%2FJalebi1.jpg?alt=media\"><img class=\"size-full wp-image-2230 aligncenter\" src=\"https://firebasestorage.googleapis.com/v0/b/cscom-2019.appspot.com/o/content%2F2015%2F01%2FJalebi1.jpg?alt=media\" alt=\"Jalebi1\" width=\"972\" height=\"1080\" /></a><br /><br />I'm going to share one more recipe which results into good results in the most bottom, but the results are non-consistent at times and the jalebis are more delicate in this way like more of a crunch and melt in mouth like melting moments.<br /><br /><br /><br /></div><br /><br /><br /><br />Now that you have the recipe in your hands, why not try it and enjoy the heavenly jalebis! Because, you know it Nothing is better than Jalebis straight from the Pan!!!!! :D<br /><br />That's all for today, Thanks :)<br /><br />&nbsp;", "updated": 1440490536000, "serves": "N/A", "slug": "jalebi-recipe", "author": "Yaman Agarwal", "recipeIngredients": [{"group": {"ingredients": [{"quantity": "2 {finely chopped}", "ingredient": "Onion"}, {"quantity": "1/4 cup", "ingredient": "Coconut"}, {"quantity": "1/4 cup {roughly diced}", "ingredient": "Potato"}, {"quantity": "1/4 cup {roughly diced}", "ingredient": "Carrots"}, {"quantity": "1/4 cup {small florets}", "ingredient": "Cauliflower"}, {"ingredient": "Beans", "quantity": "1/4 cup {chopped}"}, {"ingredient": "Paneer", "quantity": "50g {cubes}"}, {"quantity": "2 tbsp + as required to shallow fry veggies", "ingredient": "Oil"}, {"ingredient": "Cumin Seeds", "quantity": "1/2 tsp"}, {"quantity": "1/4 tsp", "ingredient": "Asafoetida"}, {"quantity": "4-5", "ingredient": "Curry Leaves"}, {"ingredient": "Green Chilis", "quantity": "2 {slit}"}, {"ingredient": "Dry Red Chilis", "quantity": "3 + 1"}, {"quantity": "2", "ingredient": "Bay Leaf"}, {"ingredient": "Ginger Garlic Paste", "quantity": "1/2 tbsp"}, {"ingredient": "Blended Tomatoes", "quantity": "6 Medium"}, {"quantity": "as per taste", "ingredient": "Salt"}, {"ingredient": "Kashmiri Red Chili Powder", "quantity": "1 tsp"}, {"quantity": "1/4 tsp", "ingredient": "Black Pepper"}, {"ingredient": "Amchoor Powder", "quantity": "1 tsp"}, {"quantity": "1 tsp", "ingredient": "Garam Masala"}, {"quantity": "1 tsp", "ingredient": "Sambhar Masala"}, {"quantity": "1/4 tsp", "ingredient": "Sugar"}, {"quantity": "handful [chopped]", "ingredient": "Coriander"}, {"quantity": "1/2 tsp", "ingredient": "Corn Flour"}, {"quantity": "1/4 cup {roughly diced}", "ingredient": "Capsicum"}, {"ingredient": "Coconut Milk", "quantity": "3 tbsp"}, {"quantity": "1 tsp", "ingredient": "Tadka Garnish : Oil"}, {"ingredient": "Mustard Seeds", "quantity": "1/2 tsp"}, {"quantity": "N/A", "ingredient": "Split Bengal Gram / Chana Dal- 1/2 tsp"}, {"ingredient": "Split Skinless Black Gram / Dhuli Urad Dal- 1/2 tsp", "quantity": "N/A"}, {"quantity": "2-3", "ingredient": "Curry Leaves"}, {"quantity": "1", "ingredient": "Dry Red Chili"}, {"ingredient": "Coriander", "quantity": "1 tsp {finely chopped}"}], "name": ""}}], "featuredImage": "https://firebasestorage.googleapis.com/v0/b/cscom-2019.appspot.com/o/content%2F2015%2F01%2FJalebi21.jpg?alt=media", "categories": [{"category": "Traditional Halwai Recipes", "slug": "traditional-halwai-recipes"}, {"slug": "indian-sweets", "category": " Indian Sweets"}], "postTags": ["Indian Cuisine (Cuisine)", " without yeast", " halwai recipes", " authentic jalebi recipe", " best jalebi recipe", " crispy jalebi recipe", " foolproof jalebi recipe", " halwai jalebi recipe", " halwai secrets", " how to make jalebi at home", " indian sweet jalebi", " instant jalebi", " instant jalebi recipe without yeast", " Jalebi (Dish)", " jalebi recipe jilebi", " jalebi recipe traditional", " jalebi recipe using rangkat", " jalebi using hydro", " no yeast jalebi", " perfect jalebi recipe", " traditional jalebi recipe"], "recipeNotes": "If you're still with me, let me give some tips: The batter can be made in any way, whether you sieve in the rangkat in flour or just add all the flour rangkat mix and then add water to make a thick paste. But make sure it is a thick paste and kind of gloopy. Then mix it as best as you can, while doing it you'd see the the batter kind of flowing more now. After mixing for about 5 minutes, you'll it is flowy, stringy, sticky and if you keep for a couple of seconds idle air bubbles will come up to the surface. It is not a strict recipe, i mean like baking recipes you can wet your hands and mix it if its way too thick or add a tsp of flour if its way too thin. Consistency should be such that it is flowy, but thick. Have you seen a halwai making these? How he presses the cloth and batter flows in a flowy stream, and when he stops it stops. <br/>I like to add baking powder, so the the jalebis puff a little in the oil and also get a little more crispy. You can use baking soda but, as it is more alkaline than baking powder jalebis will brown more. I like to have them slightly golden rather than brown spots. Both ways it should work well!<br/>You can use 1 cup of jaggery and 1 cup of sugar for syrup if you wish to use jaggery.<br/>Before starting to shape jalebis, try to play with the batter and the flame of oil. It should be such that the shape retains and you're able to make a good one. To try it and play with the heat. <br/>You need to be quick while taking the jalebis and dunking them in syrup, again be sure to dunk and not coat. Take the jalebis using a tong and dunk them in using a skimmer.<br/><br/>One more recipe, that i said would share here: Make sugar syrup using the 3/4 cup sugar, 1/4 cup water, food color and a pinch of cream of tartar/one lemon wedge as shown in video. Take 70 grams of maida, add 30 grams of urad flour(powder it in your mixer and sieve) and add in 1/4 tsp each of citric acid and baking soda. Add sufficient amount of water to make a thick batter. Transfer the batter to a disposable piping bag or a ketchup bottle or zip lock bag, and pipe jalebis in 1/2\" oil as shown in video. Cook the jalebis in medium hot oil until golden, dunk in the syrup as shown. And take out in 5-6 seconds. Serve Hot. This way also makes good jalebis but i feel the consistency is not good and also they can get soggy. Most of the times they are soggy when taken out from syrup and then they turn crunchy after 3-4 minutes from out like melting moments cookies.. These are good, but i like the rangkat one better. I just shared this as well, because I know some people might not be able to find the rangkat and would ask for a recipe without it so shared :) But trust me, You'll be able to find rangkat, in any wholesale grocery store.. Just go to your city's hyped wholesale market and ask for rangkat, or hydro or jalebi ka powder..:) Just try finding atleast 2-3 times, and not only in your regular grocery store, in the wholesale market or baking supply stores. I got it from Chawla Essence Mart, General Bazar in Hyderabad.", "title": "Jalebi Recipe - Perfect Recipe Crispy Out, Syrup Inside, Foolproof Instant - Traditional Indian Sweets Halwai Secret", "publish": true, "cookTime": "N/A", "youtubeUrl": "www.youtube.com/embed/_wuJYFCN9P8"}