{"content": "Hey Foodies,<br /><br />Motichoor Laddu, or Motichur Laddos is a weakness of many.. I mean literally, who doesn’t like these Laddus which are made up of Fried droplets/pearls of Chickpea Flour, simmered in sugar syrup and shaped into balls?<br /><br />[caption id=\"attachment_2118\" align=\"alignnone\" width=\"1920\"]<a href=\"https://firebasestorage.googleapis.com/v0/b/cscom-2019.appspot.com/o/content%2F2014%2F11%2Fmotichoorladdu6.jpg?alt=media\"><img class=\"wp-image-2118 size-full\" src=\"https://firebasestorage.googleapis.com/v0/b/cscom-2019.appspot.com/o/content%2F2014%2F11%2Fmotichoorladdu6.jpg?alt=media\" alt=\"motichoorladdu6\" width=\"1920\" height=\"1080\" /></a> Image Shot the Next Morning.[/caption]<br /><br />These, right these, are homemade.. Don’t you agree? Try it to believe it.. As soon as I posted the Motichoor Donuts, the requests for this Motichoor Laddus instantly took a peak.. So here’s my Perfect Recipe for you to make the Real Motichoor Laddus.<br /><br />[caption id=\"attachment_2113\" align=\"alignnone\" width=\"1920\"]<a href=\"https://firebasestorage.googleapis.com/v0/b/cscom-2019.appspot.com/o/content%2F2014%2F11%2Fmotichoorladdu1.jpg?alt=media\"><img class=\"wp-image-2113 size-full\" src=\"https://firebasestorage.googleapis.com/v0/b/cscom-2019.appspot.com/o/content%2F2014%2F11%2Fmotichoorladdu1.jpg?alt=media\" alt=\"motichoorladdu1\" width=\"1920\" height=\"1078\" /></a> Image shot after 2 hours being made.[/caption]<br /><br />I’m stressing on real, ask me why? Cause I’m just too skeptical about things.. Many of you might have gone through the recipes available online.. Mostly which either calls for Making Normal Boondi’s and crushing them in a food processer/blender or Soak the Mini Boondi’s in syrup like for Normal Boondi Laddus.. Common guys, these are special, These are made by making miniature pearls, then simmering in sugar syrup.. Look, Look at the pearls which, absolutely round, and perfect!<br /><br /><a href=\"https://firebasestorage.googleapis.com/v0/b/cscom-2019.appspot.com/o/content%2F2014%2F11%2Fmotichoorladdu4.jpg?alt=media\"><img class=\"wp-image-2116 aligncenter\" src=\"https://firebasestorage.googleapis.com/v0/b/cscom-2019.appspot.com/o/content%2F2014%2F11%2Fmotichoorladdu4.jpg?alt=media\" alt=\"motichoorladdu4\" width=\"390\" height=\"694\" /></a> <a href=\"https://firebasestorage.googleapis.com/v0/b/cscom-2019.appspot.com/o/content%2F2014%2F11%2Fmotichoorladdu5.jpg?alt=media\"><img class=\"wp-image-2117 aligncenter\" src=\"https://firebasestorage.googleapis.com/v0/b/cscom-2019.appspot.com/o/content%2F2014%2F11%2Fmotichoorladdu5.jpg?alt=media\" alt=\"motichoorladdu5\" width=\"391\" height=\"695\" /></a><br /><br />So, without talking much here’s the recipe and then the Tips &amp; Tricks in the Notes Section.<br /><br /><strong>WARNING : “Pretty Long Recipe Ahead, Go slow with patience.” </strong><br /><br />If you feel the recipe is over-exaggerated, I’m sorry it needs to be, Watch the video first for a better understanding.<br /><blockquote><strong>I presume, Motichoor Literally means the motis/pearls breaking easily. Choor is an Bengali Word I believe, and choor means break/crumble/crush.</strong></blockquote><br /><br /><br /><br /><br /></div><br /><br /><a href=\"https://firebasestorage.googleapis.com/v0/b/cscom-2019.appspot.com/o/content%2F2014%2F11%2Fmotichoorladdu2.jpg?alt=media\"><img class=\"wp-image-2114 aligncenter\" src=\"https://firebasestorage.googleapis.com/v0/b/cscom-2019.appspot.com/o/content%2F2014%2F11%2Fmotichoorladdu2.jpg?alt=media\" alt=\"motichoorladdu2\" width=\"559\" height=\"840\" /></a><br /><br />&nbsp;<br /><br />So, If you are still with me, That was my perfectt recipe to make Motichoor Laddus.. Perfect round miniature boondis simmered in sugar syrup! Make and enjoyy.. :) This was again a recipe, that took a lot of time and effort to develop.. Specially more effort.. Finally, one day tried making with thin batter and it came great! So, definitely takes some effort but is out of the world! That's it for today..<br /><br />Thanks<br /><br />Yaman", "updated": 1440490692000, "serves": "500grams", "slug": "motichoorladdo", "author": "Yaman Agarwal", "recipeIngredients": [{"group": {"name": "", "ingredients": [{"quantity": "2 {finely chopped}", "ingredient": "Onion"}, {"quantity": "1/4 cup", "ingredient": "Coconut"}, {"quantity": "1/4 cup {roughly diced}", "ingredient": "Potato"}, {"quantity": "1/4 cup {roughly diced}", "ingredient": "Carrots"}, {"quantity": "1/4 cup {small florets}", "ingredient": "Cauliflower"}, {"quantity": "1/4 cup {chopped}", "ingredient": "Beans"}, {"quantity": "50g {cubes}", "ingredient": "Paneer"}, {"ingredient": "Oil", "quantity": "2 tbsp + as required to shallow fry veggies"}, {"ingredient": "Cumin Seeds", "quantity": "1/2 tsp"}, {"quantity": "1/4 tsp", "ingredient": "Asafoetida"}, {"quantity": "4-5", "ingredient": "Curry Leaves"}, {"quantity": "2 {slit}", "ingredient": "Green Chilis"}, {"ingredient": "Dry Red Chilis", "quantity": "3 + 1"}, {"quantity": "2", "ingredient": "Bay Leaf"}, {"quantity": "1/2 tbsp", "ingredient": "Ginger Garlic Paste"}, {"quantity": "6 Medium", "ingredient": "Blended Tomatoes"}, {"quantity": "as per taste", "ingredient": "Salt"}, {"ingredient": "Kashmiri Red Chili Powder", "quantity": "1 tsp"}, {"quantity": "1/4 tsp", "ingredient": "Black Pepper"}, {"ingredient": "Amchoor Powder", "quantity": "1 tsp"}, {"ingredient": "Garam Masala", "quantity": "1 tsp"}, {"quantity": "1 tsp", "ingredient": "Sambhar Masala"}, {"ingredient": "Sugar", "quantity": "1/4 tsp"}, {"ingredient": "Coriander", "quantity": "handful [chopped]"}, {"quantity": "1/2 tsp", "ingredient": "Corn Flour"}, {"quantity": "1/4 cup {roughly diced}", "ingredient": "Capsicum"}, {"ingredient": "Coconut Milk", "quantity": "3 tbsp"}, {"quantity": "1 tsp", "ingredient": "Tadka Garnish : Oil"}, {"quantity": "1/2 tsp", "ingredient": "Mustard Seeds"}, {"quantity": "N/A", "ingredient": "Split Bengal Gram / Chana Dal- 1/2 tsp"}, {"quantity": "N/A", "ingredient": "Split Skinless Black Gram / Dhuli Urad Dal- 1/2 tsp"}, {"quantity": "2-3", "ingredient": "Curry Leaves"}, {"ingredient": "Dry Red Chili", "quantity": "1"}, {"quantity": "1 tsp {finely chopped}", "ingredient": "Coriander"}]}}], "featuredImage": "https://firebasestorage.googleapis.com/v0/b/cscom-2019.appspot.com/o/content%2F2014%2F11%2Fmotichoorladdu11.jpg?alt=media", "categories": [{"slug": "desserts-more", "category": "Desserts & More"}, {"slug": "holi-special", "category": " Holi Special"}, {"slug": "indian-sweets", "category": " Indian Sweets"}, {"category": " Traditional Halwai Recipes", "slug": "traditional-halwai-recipes"}], "postTags": ["Indian Cuisine (Cuisine)", " Laddu (Dish)", " best indian sweet recipes", " boondi", " boondi laddo", " boondi ladoo recipe", " easy indian sweet recipes", " halwai recipes", " halwai secret", " how to make motichoor ke laddu", " how to make motichoor ladoo at home", " how to make perfect motichoor ladoo", " how to make prepare perfect", " laddu motichur ka", " mithai sweet indian best", " motichoor ladoo", " motichoor ladoo easy recipe", " motichoor ladoo recipe", " motichur laddo recipe", " motichur laddu", " South Asian Sweets"], "recipeNotes": "TIPS / Tricks / Do’s and Don’ts: <br/><br/>Besan : For this recipe let me explain. Basically you need a coarse besan. Bombay Besan and the Normal/Coarse Besan are the normal two kinds. Bombay Besan is a fine variety of besan, usually used in the fritters. And the coarse variety which is ground coarse, specially used for Mithais, such as this, besan ki burfi, laddo and so on. Try to find the coarse variety and use it, if unable to you could try replacing 1 1/2 tbsps of besan from 1 cup of besan with semolina/suji. Though, its best to find a coarse variety which is easily available. <br/><br/><br/>Thickness of Batter : Plays a important Role, Make sure the batter is of watery consistency. It Should Not Be Thick. If its thick, the jhara’s holes may get jammed or the batter may get a little collected beneath the holes resulting in thicker/bigger boondis. On the other hand, it should not be way too diluted, it should have a like consistency. <br/><br/><br/>Consistency in Tapping : Make sure you tap/hammer your jhara’s long handle in the container/stand consistently. If you do it slowly, you may get a Fried Pancake or Lumps of Boondi / Large Boondis. *DO THIS UNDER ADULT SUPERVISION IF YOU’RE NOT AN ADULT LIKE I DID.* Be paitent, and don’t rush there’s smoky hot ghee which you’re working with.<br/><br/><br/>Frying the boondis : These motichoor boondis are even smaller and a mustard and the ghee is as hot as it would smoke which means as soon as it goes to the ghee it gets cooked in a jiffy. Make sure you take them out instantly. Also make sure you let the boondis get rid of excess ghee. And time to time transfer the boondis to a bowl so that all the boondis are excess-ghee-free. <br/><br/><br/>The syrup : As soon as the sugar melts transfer to a very very low flame and add in the fried motichoor boondis. For the moti(s) to choor you need to cook them in such a way that they absorb the syrup and get soft. I presume, the mithaiwalas make in a large quantity which means the syrup cools down tremendously and then takes a good time and the boondis get cooked well and soak the syrup well. At home, you need to either switch off the flame and add the boondis and after two minutes turn it on to the lowest flame or place it in such a flame that it is close to the flame being switched off. My hob has a very small burner I used that. <br/>Cooking this mixture till such that it starts leaving sides may turn these laddos dry, which motichoors aren’t. So you need to use something acidic, which will prevent the crystallization/drying of it. You can use a drop of lemon juice or citric acid or a tiny pinch of cream of tartar or as popularly known in hindi as “tartari”. One way of testing whether the cooking in syrup is done or not is by “grabing a boondi and pressing/trying to choor the boondi.” If it choors well its ready. Note : The known texture of super soft and melt in mouth is going to come with time. The boondis of the motichoor laddo would go even softer and as found in shops as you keep it to rest, it is kinda firm when you shape it. <br/><br/><br/>The final wait : You need to either keep the mixture for quite a time like for 4-5 hours or shape the laddus then keep them for atleast 4-5 hours. This does many things; Mingles the flavors; Makes the boondies super soft and melt in mouth and just like available in market which now may be a little firm; laddos would get sweeter.", "title": "Motichoor Laddo Recipe | Perfect Motichur Laddus - Indian Sweet Secrets Revealed", "publish": true, "cookTime": "N/A", "youtubeUrl": "www.youtube.com/embed/GwroC8kFGOk", "recipeSteps": [{"group": {"name": "", "steps": [{"text": "Start by mixing the besan, a pinch of kesar food color, ¼ tsp ghee in a bowl. Add water little by little and make a batter. Keep aside some of the water(if measured as shown), or make a medium thin batter using water as required. Let the batter rest for 15-20 minutes minimum."}, {"text": "Add more water and make a super thin, “Watery” kind batter. Heat ghee to fry the Motichoor boondis, in a kadhai/pan."}, {"text": "You’ll need a Jhara for making the miniature boondis, the finest one. Place a stand/container or some sort of thing near the pan with ghee. Make sure to keep a cloth below and above the container. The height of the container should be a couple inches above the pan."}, {"text": "On the other side, keep a plate/tray where you’ll keep the fried boondis in. Above the plate, either keep a strainer or a colander so that the excessive ghee can come out. To make these miniature boondis, its advisable to have someone help you."}, {"text": "To make these, you’ll need to consistently beat/hammer/tap down your jhara’s handle in the container and the face of jhara should be over the pan. While someone who is helping you would add a ladle full of the watery batter. And the miniature boondis would fall into the super-hot/little less hot than smoky ghee."}, {"text": "As soon as you feel all the batter has been dropped into the hot ghee, take the boondis out from the ghee. I mean instantly take them out. You don’t want to over cook them, they’re smaller than a mustard and would cook in a second as the ghee is super hot as well. Keep the fried boondis over a colander/strainer."}, {"text": "Like so, make the miniature boondis by smashing/hammering down the jhara’s stem/long handle over the container while someone adds a ladle full of batter to it and the boondis would fall into the super hot ghee and it’ll fry in a jiffy. Take them out and place in the strainer. Keep taking the boondis out from the strainer and keep in a bowl so that all boondis get a chance to leave the excess ghee."}, {"text": "After all the boondis are made, let them rest for 10-15 minutes."}, {"text": "To make the syrup, add the 180grams of sugar and 90ml of water in a pan. Add a pinch of kesar food color, a pinch of Cream of Tartar/Tartari and the rose water."}, {"text": "Heat it up and let the sugar dissolve, and switch over to a very very low flame. If your stove doesn’t have a very slow flame, switch off the flame. The flame should be such low as its closed to being switched off."}, {"text": "Add the boondis in and start stirring it. Cooking these boondis is a critical and tricky step, if you cook this less it won’t form into laddos and even if it forms it may remain kinda chewy and wet. If you cook it more, it’ll be hard and all the goodness of a melt in mouth motichoor would be void."}, {"text": "Cook it in very very low flame, just until it starts leaving sides. If you had switched off flame, switch it on after 2 minutes to the lowest flame and Cook it till Just Starts Leaving Sides. Once done, switch off flame and cover and let it be like so for 5-6 minutes."}, {"text": "Take the mixture out from the pan into a plate and spread it. Add the char magaz/melon seeds and let it cool down completely. You have two options; either make the laddus and keep them for 4-5 hours or let this mixture rest for 4-5 hours then make the laddus. I make as soon as it cools, then let them rest. I prefer to shape and then rest."}, {"text": "Shape these into laddus and then cover these and let these rest for 4-5 hours minimum. More the better, but one cannot resist any more. By this time happens, the boondis get softer, sweeter and just like a motichoor laddo should be."}, {"text": "As the time passes, and if you had made them before and let them rest which may result in slight odd shapes, you can roll them between your Ghee Greased/Wet Palms again to make them round and shiny. ENJOY!"}]}}], "prepTime": "N/A", "totalTime": "N/A", "created": 1416740239000}